Revit 2027 API
NavisworksExportOptions.ViewId Property
 The element id of the view to export. InvalidElementId by default. Used only when ExportScope = View.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ViewId { get; set; }
Public Property ViewId As ElementId
	Get
	Set
public:
property ElementId^ ViewId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member ViewId : ElementId with get, set
Property Value
ElementId
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace